---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDepthOfBoltHead
source: html/89d83c57-01e4-d9fd-245a-ce67aed98214.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDepthOfBoltHead Property

"Depth of bolt head"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleDepthOfBoltHead { get; }
```